Revit 2027 API
ElementStructuralTypeFilter Constructor
Overload List
Name | Description
ElementStructuralTypeFilter(StructuralType) |  Constructs a new instance of a filter to match elements by structural type.
ElementStructuralTypeFilter(StructuralType, Boolean) |  Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type.
Top
See Also
Reference
ElementStructuralTypeFilter Class
Autodesk.Revit.DB Namespace